Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Прибыль</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗакупочныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЗакупочныеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Прибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<AccumulationRegister>
		<Properties>
			<Name>Прибыль</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияТоваровУслуг/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Прибыль (Товары)
	// Расчет себестоимости в зависимости от метода списания FIFO, LIFO, ПоСреднему
	// Проверяем метод списания на дату документа Реализации
	ТекМетодСписания = Расчетный.ОпределениеМетодаСписания(Дата);
	
	
	// Создаем ТЗ для сохранения списанных из регистра остатков
	ТоварыНаРеализацию = Новый ТаблицаЗначений;	
	ТоварыНаРеализацию.Колонки.Добавить("Номенклатура");
	ТоварыНаРеализацию.Колонки.Добавить("Характеристика");
	ТоварыНаРеализацию.Колонки.Добавить("Количество");
	ТоварыНаРеализацию.Колонки.Добавить("Цена");
	
	// регистр ТоварыНаСкладах Расход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// Формируем список значений характеристик
		ТекСписокХарактеристик = Расчетный.УпорядочитьХарактеристикиНоменклатуры(ТекСтрокаТовары.Номенклатура,ТекМетодСписания);
		ТекСрЦена = Расчетный.СредняяЦена(ТекСтрокаТовары.Номенклатура);
		
		// Обнуляем текущие значения
		ТекКоличество = 0;
		ТекСтоимость= 0;
		ТекЭлементМассива="";
		// Выборка по всем найденным характеристикам
		Если ТекСписокХарактеристик<>Ложь Тогда 
		Для Каждого ЭлементМассива Из ТекСписокХарактеристик Цикл
			Если ТекЭлементМассива<>ЭлементМассива Тогда
				СтрокаТЗ = ТоварыНаРеализацию.Добавить();
				ТекЭлементМассива = ЭлементМассива;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ЗакупочныеЦеныСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗакупочныеЦены.СрезПоследних КАК ЗакупочныеЦеныСрезПоследних
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗакупочныеЦеныСрезПоследних.Номенклатура
			|			И ТоварыНаСкладахОстатки.Характеристика = ЗакупочныеЦеныСрезПоследних.Характеристика
			|ГДЕ
			|	ТоварыНаСкладахОстатки.Характеристика = &Характеристика
			|	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
		
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Номенклатура);
			Запрос.УстановитьПараметр("Характеристика", ЭлементМассива);
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий(); 
			
			КоличествоПоТекХарактеристики = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			
						
		
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			
			ТекКоличество = ТекКоличество+КоличествоПоТекХарактеристики;
			
			Если ТекКоличество < ТекСтрокаТовары.Количество Тогда
				//Временная таблица значений
				СтрокаТЗ.Номенклатура = ТекСтрокаТовары.Номенклатура;
				СтрокаТЗ.Характеристика = ЭлементМассива;
				СтрокаТЗ.Количество = КоличествоПоТекХарактеристики;
				Если ТекМетодСписания = Справочники.МетодыСписанияСебестоимости.ПоСреднему.Наименование Тогда
					СтрокаТЗ.Цена = ТекСрЦена;	
				Иначе
					СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				СтрокаТЗ = ТоварыНаРеализацию.Добавить();
				
				//Запишем движение в регистр ТоварыНаСкладах
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Характеристика = ЭлементМассива;
				Движение.Количество = КоличествоПоТекХарактеристики;
				Продолжить;
			ИначеЕсли ТекКоличество > ТекСтрокаТовары.Количество Тогда
				//Временная таблица значений
				СтрокаТЗ.Номенклатура = ТекСтрокаТовары.Номенклатура;
				СтрокаТЗ.Характеристика = ЭлементМассива;
				СтрокаТЗ.Количество = КоличествоПоТекХарактеристики - Расчетный.МодульЧисла(ТекКоличество - ТекСтрокаТовары.Количество);
				Если ТекМетодСписания = Справочники.МетодыСписанияСебестоимости.ПоСреднему.Наименование Тогда
					СтрокаТЗ.Цена = ТекСрЦена;	
				Иначе
					СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				//СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
				
				//Запишем движение в регистр ТоварыНаСкладах
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Характеристика = ЭлементМассива;
				Движение.Количество = КоличествоПоТекХарактеристики - Расчетный.МодульЧисла(ТекКоличество - ТекСтрокаТовары.Количество);
				Прервать;
			ИначеЕсли ТекКоличество = ТекСтрокаТовары.Количество Тогда
				//Временная таблица значений
				СтрокаТЗ.Номенклатура = ТекСтрокаТовары.Номенклатура;
				СтрокаТЗ.Характеристика = ЭлементМассива;
				СтрокаТЗ.Количество = ТекКоличество;
				Если ТекМетодСписания = Справочники.МетодыСписанияСебестоимости.ПоСреднему.Наименование Тогда
					СтрокаТЗ.Цена = ТекСрЦена;	
				Иначе
					СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				//СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
				
				//Запишем движение в регистр ТоварыНаСкладах
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Характеристика = ЭлементМассива;
				Движение.Количество = ТекКоличество;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	//Проверка на отр. остатки
	Движения.ТоварыНаСкладах.записать();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОбщееКоличество,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ОбщееКоличествоПоНом
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, ) КАК ТоварыНаСкладахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоПоТекХарактеристики,
		|	РеализацияТоваровУслугТовары.Количество КАК ЗапрашиваемоеКоличество,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ВТ_ОбщееКоличествоПоНом.ОбщееКоличество КАК ОбщееКоличество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличествоПоНом КАК ВТ_ОбщееКоличествоПоНом
		|			ПО (ВТ_ОбщееКоличествоПоНом.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если  ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Недостача = ВыборкаДетальныеЗаписи.ОбщееКоличество-ВыборкаДетальныеЗаписи.ЗапрашиваемоеКоличество;
			Сообщить("Не достаточно товара " + ВыборкаДетальныеЗаписи.Номенклатура + "в количестве " + Недостача); 
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;	
	
	Движения.Прибыль.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		ТекНом = ТекСтрокаТовары.Номенклатура;
		СебеСтоимость = 0;
		Движение = Движения.Прибыль.Добавить();
		Для Каждого СтрокаТЗ из ТоварыНаРеализацию Цикл
			Если ТекНом = СтрокаТЗ.Номенклатура Тогда;
				Движение.Период = Дата;
				СебеСтоимость = СебеСтоимость + СтрокаТЗ.Количество*СтрокаТЗ.Цена;
				Движение.Номенклатура = СтрокаТЗ.Номенклатура;
				Движение.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
				Движение.Сумма = ТекСтрокаТовары.Стоимость - СебеСтоимость;
			КонецЕсли;	
		КонецЦикла
	КонецЦикла;

	// регистр Прибыль  (Услуги)
	Движения.Прибыль.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Прибыль.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
		Движение.Сумма = ТекСтрокаУслуги.Стоимость; 
	КонецЦикла;
КонецПроцедуры
